{
    "architectures": [
      "MultitaskProteinModel"
    ],
    "model_type": "metalatte",
    "num_labels": 15,
    "hidden_size": 1280,
    "num_hidden_layers": 33,
    "num_attention_heads": 10,
    "intermediate_size": 5120,
    "hidden_act": "gelu",
    "hidden_dropout_prob": 0.0,
    "attention_probs_dropout_prob": 0.0,
    "max_position_embeddings": 1026,
    "initializer_range": 0.02,
    "layer_norm_eps": 1e-5,
    "esm_model_name": "facebook/esm2_t33_650M_UR50D",
    "num_layers_to_finetune": 2,
    "num_linear_layers": 3,
    "hidden_dim": 512,
    "id2label": {
      "0": "Ag", "1": "Cd", "2": "Co", "3": "Cu", "4": "Fe",
      "5": "Hg", "6": "Mn", "7": "Mo", "8": "Ni", "9": "Pb",
      "10": "Pt", "11": "V", "12": "W", "13": "Zn", "14": "Non-binding"
    },
    "label2id": {
      "Ag": 0, "Cd": 1, "Co": 2, "Cu": 3, "Fe": 4,
      "Hg": 5, "Mn": 6, "Mo": 7, "Ni": 8, "Pb": 9,
      "Pt": 10, "V": 11, "W": 12, "Zn": 13, "Non-binding": 14
    }
  }